In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
data= Series (['one','two',np.nan,'four'])

In [3]:
data

0     one
1     two
2     NaN
3    four
dtype: object

In [4]:
data.isNull()

AttributeError: 'Series' object has no attribute 'isNull'

In [5]:
data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
data.dropna()

0     one
1     two
3    four
dtype: object

In [18]:
dframe1=DataFrame([[1,2,3],[np.nan,5,6,7],[7,9,np.nan],[np.nan,np.nan,np.nan,]])

In [8]:
dframe1

    0   1   2   3
0   1   2   3 NaN
1 NaN   5   6   7
2   7   9 NaN NaN
3 NaN NaN NaN NaN

In [9]:
clean_dframe=dframe1.dropna()

In [11]:
clean_dframe

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [12]:
dframe1.dropna(how='all') # the how method will drop only those rows in which all data is null

    0  1   2   3
0   1  2   3 NaN
1 NaN  5   6   7
2   7  9 NaN NaN

In [13]:
dframe1.dropna(axis=1) # to drop columns with null values use the axis()

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [14]:
dframe1

    0   1   2   3
0   1   2   3 NaN
1 NaN   5   6   7
2   7   9 NaN NaN
3 NaN NaN NaN NaN

In [17]:
npn=np.nan
dframe2=DataFrame([[1,2,3,npn],[2,npn,5,6],[npn,7,npn,9],[1,npn,npn,npn]])

In [19]:
dframe1

    0   1   2   3
0   1   2   3 NaN
1 NaN   5   6   7
2   7   9 NaN NaN
3 NaN NaN NaN NaN

In [20]:
dframe2

    0   1   2   3
0   1   2   3 NaN
1   2 NaN   5   6
2 NaN   7 NaN   9
3   1 NaN NaN NaN

In [21]:
dframe1.fillna(1)

   0  1  2  3
0  1  2  3  1
1  1  5  6  7
2  7  9  1  1
3  1  1  1  1

In [22]:
dframe2

    0   1   2   3
0   1   2   3 NaN
1   2 NaN   5   6
2 NaN   7 NaN   9
3   1 NaN NaN NaN

In [23]:
dframe2.fillna({0:0,1:1,2:2,3:3})

   0  1  2  3
0  1  2  3  3
1  2  1  5  6
2  0  7  2  9
3  1  1  2  3

In [26]:
# To make changes permanent in the dataframe when dealing with missing data use 'inplace=TRUE'
dframe2.fillna(0,inplace='TRUE')

In [27]:
dframe2

   0  1  2  3
0  1  2  3  0
1  2  0  5  6
2  0  7  0  9
3  1  0  0  0